{
  "language": "en",
  "dark_mode": "Dark Mode",
  "home_welcome": "Hi there",
  "home_i": "i'm",
  "home_what_i_do": "I am a Software Engineer",
  "home_job": "Full stack web developer, Machine Learning Enthusiast, Database Administrator",
  "home_location": "Based in Gainesville, Florida",
  "home_contact_btn": "Get in touch",
  "menu_about": "About",
  "menu_projects": "Projects",
  "menu_experience": "Experience",
  "menu_contact": "Contact",
  "menu_resume": "Resume",
  "about_desc": "Hello there! I am Vishesha Sadu, a software engineer with expertise in web development, machine learning, deep learning, NLP, and computer Database Administration. I hold a Master's degree in Computer Science from the University of Florida and a Bachelor's degree in Information Technology from the National Institute of Technology in India. I have hands-on experience in various programming languages such as C, C++, Python, Java, and Golang, as well as proficiency in databases like MySQL, SQLite, MongoDB, and Oracle. My skills extend to markup languages like HTML, CSS, and XML, and I have worked with popular libraries and frameworks including TensorFlow, Keras, DJANGO, Bootstrap, Angular, and React. As a Software Engineer at Nokia Solutions and Networks, I have worked on providing L4 operation development and support, Database tuning, troubleshooting platform issues, and automating tasks using shell scripting for telecom charging products and platforms. During my time as a Research Intern at Samsung R&D Institute India, I contributed to a project on text extraction and developed an Android feature to reduce redundant issues in the platform services team. I have done several projects showcasing my skills in Web development, Machine Learning and Deep Learning Areas. I am open to new opportunities. Feel free to explore my portfolio and connect with me via email or LinkedIn. Let's collaborate and create something amazing together! ",
  "experience_0_job": "Software Engineer",
  "experience_0_overview": "During my time at Nokia Solutions and Networks, I played a key role in L4 operation development and support, focusing on troubleshooting platform issues and automating manual tasks using shell scripting. I conducted in-depth analysis of database errors and performed database tuning across various Unix operating systems for global customers. Additionally, I resolved platform issues related to memory, space, and databases, working extensively with RedHat Linux, SQL, Oracle, and applications. I also gained valuable experience in data replication for telecom charging products and platforms, serving clients from around the world. Engaging in end-to-end maintenance, problem analysis, testing, development, and issue resolution, I successfully addressed over 50 issues for 5 clients in the Intelligent Networks domain.",
  "experience_0_duration": "July 2020 – December 2021",
  "experience_1_job": "Research Intern",
  "experience_1_overview": "During my research internship at Samsung R&D Institute India, I took on various responsibilities and contributed to significant projects. I led the design and development of a project called Character, Emotion, and Summary Extraction from the Text, which utilized techniques like entity extraction with POS tagging and BERT (NLP). This implementation resulted in a remarkable 10% improvement in accuracy. Additionally, I played a key role in coordinating the evaluation and analysis of over 20 patent ideas, showcasing my ability to contribute to innovative research. Moreover, I identified the root causes of issues within the platform services team and developed an Android feature that effectively reduced redundant issues by 15%. These experiences highlight my expertise in NLP, research coordination, and problem-solving skills, which I bring to the table for any challenging project.",
  "experience_1_duration": "January 2020 – April 2020",
  "experience_2_job": "Research Assistant",
  "experience_2_overview": "As part of my project work at NIT PATNA, I successfully implemented a Virtual College Assistant using Java, SQLite, AIML, and Android Studio technologies. This Android application serves as a valuable college assistant, providing prompt answers to student queries. It has been instrumental in supporting over 4000 new college students and over 1000 incoming students annually. By leveraging my skills in Java development, database management with SQLite, and integrating AIML for intelligent responses, I was able to create a user-friendly and effective tool that enhances the college experience for students.",
  "experience_2_duration": "May 2019 – July 2019",
  "projects_1_overview": "Globe Scanner is an open-source trip advisor website built with Angular and Golang's Gin framework, enabling travelers to enhance their trip planning and booking experience.",
  "projects_2_overview": "I developed a real-time object detection and recognition system using TensorFlow, PyTorch, and OpenCV, providing accurate and efficient results for images and videos.",
  "projects_3_overview": " I developed a text summarization system which is capable of extracting concise summaries from user-specified web pages within seconds.",
  "projects_4_overview": "I developed a news bias detection system using NLP, deep learning techniques to analyze sentiment and identify similarities and differences across different newspapers.",
  "projects_5_overview": "This is Video generation project that converts text from web URLs into videos by extracting text, performing image search and processing images to video and adding audio",
  "projects_6_overview": "I built a Twitter clone with a functional engine that supports registration, tweet functionalities, live tweet delivery, and a tester/simulator for multi-user simulation. using Erlang.",
  "projects_1_extended_overview": "Globe Scanner is an innovative and open-source trip advisor website that aims to revolutionize the way people plan and book their trips. Leveraging the power of Angular and Golang's Gin framework, the platform provides a seamless user experience, allowing travelers from over 100 countries to access valuable information, recommendations, and booking services. By offering a comprehensive range of features, from trip planning and connecting tourists with the tour guides to providing real-time booking options, Globe Scanner empowers travelers to make informed decisions and embark on unforgettable journeys.",
  "projects_2_extended_overview": "As part of my project work, I created an advanced object detection and recognition system that utilizes deep learning techniques like YOLO, SSD, and R-CNN. By leveraging the power of TensorFlow, PyTorch, and OpenCV, I developed a real-time solution capable of accurately detecting and recognizing objects in images and videos. I integrated sophisticated image processing algorithms and designed a user-friendly interface, ensuring seamless input of media for efficient and precise object detection. This project showcases my expertise in deep learning, computer vision, and software development, offering a valuable tool for a wide range of applications, from security systems to autonomous vehicles.",
  "projects_3_extended_overview": "I developed a text summarization system that efficiently extracts concise summaries from individual web pages based on user queries. Leveraging Python, KNN, TF-IDF, and machine learning techniques, I implemented a solution that quickly generates top 50 summaries from web pages, reducing processing time by 30%. By utilizing TF-IDF and KNN-based co-relation scoring, the system effectively analyzes and summarizes the most relevant information, providing users with quick access to essential content. This project demonstrates my expertise in natural language processing, machine learning, and web scraping, offering an invaluable tool for information retrieval and content summarization.",
  "projects_4_extended_overview": "This project focused on developing a sophisticated news bias detection system that utilized natural language processing, deep learning techniques like recurrent neural networks (RNN) and long short-term memory (LSTM), as well as TensorFlow and Keras frameworks. By leveraging sentiment analysis of text scraped from various news articles, the system aimed to detect similarities and differences in trends across 10 different newspapers. This project showcased my expertise in NLP, deep learning, and sentiment analysis, providing insights into news biases and facilitating critical analysis of media sources. It demonstrated my ability to apply advanced techniques to tackle real-world challenges in the field of news analysis and information evaluation.",
  "projects_5_extended_overview": "In this project, I have worked on the conversion of user text or web URLs into videos through a multi-step process. By leveraging NLP, machine learning, CV2, Sumy, bs4, and PIL, I developed a system that extracted text from web scraping or split user-provided text into queries for image search. This approach significantly reduced processing time by 45%. Next, the system retrieved relevant images and converted them into frames, creating a sequence for the video. Finally, the project incorporated user-generated audio, providing a complete video output in just around 2 minutes. This project showcased my expertise in natural language processing, machine learning, web scraping, and multimedia processing, demonstrating the potential for innovative and efficient content generation from text sources.",
  "projects_6_extended_overview": "I have developed a Twitter clone with a robust engine that encompassed essential features like user registration, tweet sending with hashtags and mentions, tweet subscriptions, re-tweets, and live tweet delivery. Additionally, I created a comprehensive tester/simulator to thoroughly test the engine's capabilities by simulating multiple users, live connections, and disconnections. To enhance the simulation realism, I implemented a Zipf distribution on subscriber numbers. Notably, the client and engine components were separate processes, allowing for scalability and efficient handling of thousands of clients. This project showcases my proficiency in web development, networking, and system design, highlighting my ability to create functional and scalable platforms similar to popular social media applications.",
  "contact_full_name": "Full name",
  "contact_email": "E-mail adress",
  "contact_btn": "Send message"
}
